def ip_info():
    ip = input("Введите IP-адрес: ")
    if ip.lower() == "exit":
        return
    try:
        o1 = int(ip.split('.')[0])
    except ValueError:
        print("Некорректно введён IP-адрес")
        return ip_info()
    if 0 <= o1 <= 127:
        print("Класс: A \nНачальный адрес: 0.0.0.0 \nКонечный адрес: 127.255.255.255 \nМаска: 255.0.0.0\n")
    elif 128 <= o1 <= 191:
        print("Класс: B \nНачальный адрес: 128.0.0.0 \nКонечный адрес: 191.255.255.255 \nМаска: 255.255.0.0\n")
    elif 192 <= o1 <= 223:
        print("Класс: C \nНачальный адрес: 192.0.0.0 \nКонечный адрес: 223.255.255.255 \nМаска: 255.255.225.0\n")
    elif 224 <= o1 <= 239:
        print("Класс: D \nНачальный адрес: 224.0.0.0 \nКонечный адрес: 239.255.255.255")
    elif 240 <= o1 <= 255:
        print("Класс: E \nНачальный адрес: 240.0.0.0 \nКонечный адрес: 255.255.255.255\n")
    else:
        print("Некорректно введён IP-адрес")
        return ip_info()
    return ip_info()


if __name__ == '__main__':
    ip_info()
